hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F467.svd
                <register>
                    <name>TMCR_T_ESR</name>
                    <description>desc TMCR_T_ESR</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x14</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>T_ESR</name>
                            <description>desc T_ESR</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCR0</name>
                    <description>desc CSCR0</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0x101FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMSK</name>
                            <description>desc ADDMSK</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT</name>
                            <description>desc ADDMAT</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRC</name>
                            <description>desc BRC</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCR1</name>
                    <description>desc CSCR1</description>
                    <addressOffset>0x204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0x101FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMSK</name>
                            <description>desc ADDMSK</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT</name>
                            <description>desc ADDMAT</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRC</name>
                            <description>desc BRC</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCR2</name>
                    <description>desc CSCR2</description>
                    <addressOffset>0x208</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0x101FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMSK</name>
                            <description>desc ADDMSK</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT</name>
                            <description>desc ADDMAT</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRC</name>
                            <description>desc BRC</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCR3</name>
                    <description>desc CSCR3</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0x101FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADDMSK</name>
                            <description>desc ADDMSK</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDMAT</name>
                            <description>desc ADDMAT</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRC</name>
                            <description>desc BRC</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BACR</name>
                    <description>desc BACR</description>
                    <addressOffset>0x300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x300</resetValue>
                    <resetMask>0x100C003</resetMask>
                    <fields>
                        <field>
                            <name>DMCMW</name>
                            <description>desc DMCMW</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKSEL</name>
                            <description>desc CKSEL</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
