hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F467.svd
                <register>
                    <name>POTRI</name>
                    <description>desc POTRI</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3000</resetMask>
                    <fields>
                        <field>
                            <name>POT12</name>
                            <description>desc POT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT13</name>
                            <description>desc POT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPCR</name>
                    <description>desc PSPCR</description>
                    <addressOffset>0x3F4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x1F</resetValue>
                    <resetMask>0x1F</resetMask>
                    <fields>
                        <field>
                            <name>SPFE</name>
                            <description>desc SPFE</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCCR</name>
                    <description>desc PCCR</description>
                    <addressOffset>0x3F8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0x703F</resetMask>
                    <fields>
                        <field>
                            <name>BFSEL</name>
                            <description>desc BFSEL</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDWT</name>
                            <description>desc RDWT</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PINAER</name>
                    <description>desc PINAER</description>
                    <addressOffset>0x3FA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>PINAE</name>
                            <description>desc PINAE</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWPR</name>
                    <description>desc PWPR</description>
                    <addressOffset>0x3FC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF01</resetMask>
                    <fields>
                        <field>
                            <name>WE</name>
                            <description>desc WE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WP</name>
                            <description>desc WP</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCRA0</name>
                    <description>desc PCRA0</description>
                    <addressOffset>0x400</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xD777</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDIS</name>
                            <description>desc DDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRA0</name>
                    <description>desc PFSRA0</description>
                    <addressOffset>0x402</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13F</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BFE</name>
                            <description>desc BFE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCRA1</name>
                    <description>desc PCRA1</description>
                    <addressOffset>0x404</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xD777</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDIS</name>
                            <description>desc DDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRA1</name>
                    <description>desc PFSRA1</description>
                    <addressOffset>0x406</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13F</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BFE</name>
                            <description>desc BFE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCRA2</name>
                    <description>desc PCRA2</description>
                    <addressOffset>0x408</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xD777</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDIS</name>
                            <description>desc DDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRA2</name>
                    <description>desc PFSRA2</description>
                    <addressOffset>0x40A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13F</resetMask>
                    <fields>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>5</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BFE</name>
                            <description>desc BFE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCRA3</name>
                    <description>desc PCRA3</description>
                    <addressOffset>0x40C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xD777</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDIS</name>
                            <description>desc DDIS</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
