hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F467.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>NFC</name>
            <description>desc NFC</description>
            <baseAddress>0x88100000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x8180</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DATR_BASE</name>
                    <description>desc DATR_BASE</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>CMDR</name>
                    <description>desc CMDR</description>
                    <addressOffset>0x8000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMD</name>
                            <description>desc CMD</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARG</name>
                            <description>desc ARG</description>
                            <msb>31</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDXR0</name>
                    <description>desc IDXR0</description>
                    <addressOffset>0x8004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>IENR</name>
                    <description>desc IENR</description>
                    <addressOffset>0x8030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFD3</resetMask>
                    <fields>
                        <field>
                            <name>ECCEUEN</name>
                            <description>desc ECCEUEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCECEN</name>
                            <description>desc ECCECEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCCEN</name>
                            <description>desc ECCCEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCEEN</name>
                            <description>desc ECCEEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCDIS</name>
                            <description>desc ECCDIS</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RBEN</name>
                            <description>desc RBEN</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISTR</name>
                    <description>desc ISTR</description>
                    <addressOffset>0x8034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF53</resetMask>
                    <fields>
                        <field>
                            <name>ECCEUST</name>
                            <description>desc ECCEUST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCECST</name>
                            <description>desc ECCECST</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCCST</name>
                            <description>desc ECCCST</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCEST</name>
                            <description>desc ECCEST</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RBST</name>
                            <description>desc RBST</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRSR</name>
                    <description>desc IRSR</description>
                    <addressOffset>0x8038</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF53</resetMask>
                    <fields>
                        <field>
                            <name>ECCEURS</name>
                            <description>desc ECCEURS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCECRS</name>
                            <description>desc ECCECRS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCCRS</name>
                            <description>desc ECCCRS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCERS</name>
                            <description>desc ECCERS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RBRS</name>
                            <description>desc RBRS</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDXR1</name>
                    <description>desc IDXR1</description>
                    <addressOffset>0x8048</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>IDX1</name>
                            <description>desc IDX1</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR0</name>
                    <description>desc TMCR0</description>
                    <addressOffset>0x804C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3030202</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TS</name>
                            <description>desc TS</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TWP</name>
                            <description>desc TWP</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRP</name>
                            <description>desc TRP</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH</name>
                            <description>desc TH</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR1</name>
                    <description>desc TMCR1</description>
                    <addressOffset>0x8050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x28080303</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TWH</name>
                            <description>desc TWH</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRH</name>
                            <description>desc TRH</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRR</name>
                            <description>desc TRR</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TWB</name>
                            <description>desc TWB</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BACR</name>
                    <description>desc BACR</description>
                    <addressOffset>0x8054</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2187</resetValue>
                    <resetMask>0xFF3FCF</resetMask>
                    <fields>
                        <field>
                            <name>SIZE</name>
                            <description>desc SIZE</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B16BIT</name>
                            <description>desc B16BIT</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BANK</name>
                            <description>desc BANK</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAGE</name>
                            <description>desc PAGE</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WP</name>
                            <description>desc WP</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ECCM</name>
                            <description>desc ECCM</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAC</name>
                            <description>desc RAC</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCS</name>
                            <description>desc SCS</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMCR2</name>
                    <description>desc TMCR2</description>
                    <addressOffset>0x805C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3050D03</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TCCS</name>
                            <description>desc TCCS</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TWTR</name>
                            <description>desc TWTR</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRTW</name>
                            <description>desc TRTW</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TADL</name>
                            <description>desc TADL</description>
                            <msb>31</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECCR0</name>
                    <description>desc ECCR0</description>
                    <addressOffset>0x8060</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFF</resetMask>
                    <fields>
                        <field>
                            <name>ERRLOC</name>
                            <description>desc ERRLOC</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>desc SE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ME</name>
                            <description>desc ME</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECCR1</name>
                    <description>desc ECCR1</description>
                    <addressOffset>0x8064</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFF</resetMask>
                    <fields>
                        <field>
                            <name>ERRLOC</name>
                            <description>desc ERRLOC</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>desc SE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ME</name>
                            <description>desc ME</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECCR2</name>
                    <description>desc ECCR2</description>
                    <addressOffset>0x8068</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFF</resetMask>
                    <fields>
                        <field>
                            <name>ERRLOC</name>
                            <description>desc ERRLOC</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>desc SE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ME</name>
                            <description>desc ME</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECCR3</name>
                    <description>desc ECCR3</description>
                    <addressOffset>0x806C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFF</resetMask>
                    <fields>
                        <field>
                            <name>ERRLOC</name>
                            <description>desc ERRLOC</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SE</name>
                            <description>desc SE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ME</name>
                            <description>desc ME</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
