hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F467.svd
                <register>
                    <name>FCG2</name>
                    <description>desc FCG2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFBFFF</resetMask>
                    <fields>
                        <field>
                            <name>TMR6_1</name>
                            <description>desc TMR6_1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_2</name>
                            <description>desc TMR6_2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_3</name>
                            <description>desc TMR6_3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_4</name>
                            <description>desc TMR6_4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_5</name>
                            <description>desc TMR6_5</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_6</name>
                            <description>desc TMR6_6</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_7</name>
                            <description>desc TMR6_7</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR6_8</name>
                            <description>desc TMR6_8</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR4_1</name>
                            <description>desc TMR4_1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR4_2</name>
                            <description>desc TMR4_2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR4_3</name>
                            <description>desc TMR4_3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HRPWM</name>
                            <description>desc HRPWM</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_1</name>
                            <description>desc TMR0_1</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_2</name>
                            <description>desc TMR0_2</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMB</name>
                            <description>desc EMB</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR2_1</name>
                            <description>desc TMR2_1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR2_2</name>
                            <description>desc TMR2_2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR2_3</name>
                            <description>desc TMR2_3</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR2_4</name>
                            <description>desc TMR2_4</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_1</name>
                            <description>desc TMRA_1</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_2</name>
                            <description>desc TMRA_2</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_3</name>
                            <description>desc TMRA_3</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_4</name>
                            <description>desc TMRA_4</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_5</name>
                            <description>desc TMRA_5</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_6</name>
                            <description>desc TMRA_6</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_7</name>
                            <description>desc TMRA_7</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_8</name>
                            <description>desc TMRA_8</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCG3</name>
                    <description>desc FCG3</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0x3FF7933F</resetMask>
                    <fields>
                        <field>
                            <name>ADC1</name>
                            <description>desc ADC1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC2</name>
                            <description>desc ADC2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC3</name>
                            <description>desc ADC3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBIAS</name>
                            <description>desc CMBIAS</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DAC1</name>
                            <description>desc DAC1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP12</name>
                            <description>desc CMP12</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP3</name>
                            <description>desc CMP3</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTS</name>
                            <description>desc OTS</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DVP</name>
                            <description>desc DVP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMC</name>
                            <description>desc SMC</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMC</name>
                            <description>desc DMC</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFC</name>
                            <description>desc NFC</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1</name>
                            <description>desc USART1</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART2</name>
                            <description>desc USART2</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART3</name>
                            <description>desc USART3</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART4</name>
                            <description>desc USART4</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART5</name>
                            <description>desc USART5</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART6</name>
                            <description>desc USART6</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART7</name>
                            <description>desc USART7</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART10</name>
                            <description>desc USART10</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCG0PC</name>
                    <description>desc FCG0PC</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF0001</resetMask>
                    <fields>
                        <field>
                            <name>PRT0</name>
                            <description>desc PRT0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCG0PCWE</name>
                            <description>desc FCG0PCWE</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VBATRSTR</name>
                    <description>desc VBATRSTR</description>
                    <addressOffset>0x4430</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>VBATCR</name>
                    <description>desc VBATCR</description>
                    <addressOffset>0x4440</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8F</resetMask>
                    <fields>
                        <field>
                            <name>VBTRSD</name>
                            <description>desc VBTRSD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMVALID</name>
                            <description>desc RAMVALID</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMPDF</name>
                            <description>desc RAMPDF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBATDIVMONE</name>
                            <description>desc VBATDIVMONE</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CSDIS</name>
                            <description>desc CSDIS</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WKTC0</name>
                    <description>desc WKTC0</description>
                    <addressOffset>0x4450</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WKTMCMP</name>
                            <description>desc WKTMCMP</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WKTC1</name>
                    <description>desc WKTC1</description>
                    <addressOffset>0x4454</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>WKTMCMP</name>
                            <description>desc WKTMCMP</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WKTC2</name>
                    <description>desc WKTC2</description>
                    <addressOffset>0x4458</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0</resetMask>
                    <fields>
                        <field>
                            <name>WKOVF</name>
                            <description>desc WKOVF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKCKS</name>
                            <description>desc WKCKS</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKTCE</name>
                            <description>desc WKTCE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BKR0</name>
                    <description>desc BKR0</description>
                    <addressOffset>0x4600</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR1</name>
                    <description>desc BKR1</description>
                    <addressOffset>0x4604</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR2</name>
                    <description>desc BKR2</description>
                    <addressOffset>0x4608</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR3</name>
                    <description>desc BKR3</description>
                    <addressOffset>0x460C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
