hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F467.svd
                <register>
                    <name>BKR65</name>
                    <description>desc BKR65</description>
                    <addressOffset>0x4704</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR66</name>
                    <description>desc BKR66</description>
                    <addressOffset>0x4708</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR67</name>
                    <description>desc BKR67</description>
                    <addressOffset>0x470C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR68</name>
                    <description>desc BKR68</description>
                    <addressOffset>0x4710</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR69</name>
                    <description>desc BKR69</description>
                    <addressOffset>0x4714</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR70</name>
                    <description>desc BKR70</description>
                    <addressOffset>0x4718</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR71</name>
                    <description>desc BKR71</description>
                    <addressOffset>0x471C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR72</name>
                    <description>desc BKR72</description>
                    <addressOffset>0x4720</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR73</name>
                    <description>desc BKR73</description>
                    <addressOffset>0x4724</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR74</name>
                    <description>desc BKR74</description>
                    <addressOffset>0x4728</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR75</name>
                    <description>desc BKR75</description>
                    <addressOffset>0x472C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR76</name>
                    <description>desc BKR76</description>
                    <addressOffset>0x4730</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR77</name>
                    <description>desc BKR77</description>
                    <addressOffset>0x4734</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR78</name>
                    <description>desc BKR78</description>
                    <addressOffset>0x4738</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR79</name>
                    <description>desc BKR79</description>
                    <addressOffset>0x473C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR80</name>
                    <description>desc BKR80</description>
                    <addressOffset>0x4740</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR81</name>
                    <description>desc BKR81</description>
                    <addressOffset>0x4744</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR82</name>
                    <description>desc BKR82</description>
                    <addressOffset>0x4748</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR83</name>
                    <description>desc BKR83</description>
                    <addressOffset>0x474C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR84</name>
                    <description>desc BKR84</description>
                    <addressOffset>0x4750</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR85</name>
                    <description>desc BKR85</description>
                    <addressOffset>0x4754</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR86</name>
                    <description>desc BKR86</description>
                    <addressOffset>0x4758</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR87</name>
                    <description>desc BKR87</description>
                    <addressOffset>0x475C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR88</name>
                    <description>desc BKR88</description>
                    <addressOffset>0x4760</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR89</name>
                    <description>desc BKR89</description>
                    <addressOffset>0x4764</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR90</name>
                    <description>desc BKR90</description>
                    <addressOffset>0x4768</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR91</name>
                    <description>desc BKR91</description>
                    <addressOffset>0x476C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR92</name>
                    <description>desc BKR92</description>
                    <addressOffset>0x4770</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR93</name>
                    <description>desc BKR93</description>
                    <addressOffset>0x4774</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR94</name>
                    <description>desc BKR94</description>
                    <addressOffset>0x4778</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR95</name>
                    <description>desc BKR95</description>
                    <addressOffset>0x477C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR96</name>
                    <description>desc BKR96</description>
                    <addressOffset>0x4780</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR97</name>
                    <description>desc BKR97</description>
                    <addressOffset>0x4784</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR98</name>
                    <description>desc BKR98</description>
                    <addressOffset>0x4788</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR99</name>
                    <description>desc BKR99</description>
                    <addressOffset>0x478C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR100</name>
                    <description>desc BKR100</description>
                    <addressOffset>0x4790</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR101</name>
                    <description>desc BKR101</description>
                    <addressOffset>0x4794</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR102</name>
                    <description>desc BKR102</description>
                    <addressOffset>0x4798</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR103</name>
                    <description>desc BKR103</description>
                    <addressOffset>0x479C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR104</name>
                    <description>desc BKR104</description>
                    <addressOffset>0x47A0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR105</name>
                    <description>desc BKR105</description>
                    <addressOffset>0x47A4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR106</name>
                    <description>desc BKR106</description>
                    <addressOffset>0x47A8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR107</name>
                    <description>desc BKR107</description>
                    <addressOffset>0x47AC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR108</name>
                    <description>desc BKR108</description>
                    <addressOffset>0x47B0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR109</name>
                    <description>desc BKR109</description>
                    <addressOffset>0x47B4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR110</name>
                    <description>desc BKR110</description>
                    <addressOffset>0x47B8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR111</name>
                    <description>desc BKR111</description>
                    <addressOffset>0x47BC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR112</name>
                    <description>desc BKR112</description>
                    <addressOffset>0x47C0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR113</name>
                    <description>desc BKR113</description>
                    <addressOffset>0x47C4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR114</name>
                    <description>desc BKR114</description>
                    <addressOffset>0x47C8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR115</name>
                    <description>desc BKR115</description>
                    <addressOffset>0x47CC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR116</name>
                    <description>desc BKR116</description>
                    <addressOffset>0x47D0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR117</name>
                    <description>desc BKR117</description>
                    <addressOffset>0x47D4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR118</name>
                    <description>desc BKR118</description>
                    <addressOffset>0x47D8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR119</name>
                    <description>desc BKR119</description>
                    <addressOffset>0x47DC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR120</name>
                    <description>desc BKR120</description>
                    <addressOffset>0x47E0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR121</name>
                    <description>desc BKR121</description>
                    <addressOffset>0x47E4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR122</name>
                    <description>desc BKR122</description>
                    <addressOffset>0x47E8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR123</name>
                    <description>desc BKR123</description>
                    <addressOffset>0x47EC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR124</name>
                    <description>desc BKR124</description>
                    <addressOffset>0x47F0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BKR125</name>
                    <description>desc BKR125</description>
                    <addressOffset>0x47F4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
