hdscmcu/sdk-csp-hc32f4/debug/svd/HC32F467.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RMU</name>
            <description>desc RMU</description>
            <baseAddress>0x4004CC00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PRSTCR0</name>
                    <description>desc PRSTCR0</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0x20</resetMask>
                    <fields>
                        <field>
                            <name>LKUPREN</name>
                            <description>desc LKUPREN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTF0</name>
                    <description>desc RSTF0</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0xC0007FFF</resetMask>
                    <fields>
                        <field>
                            <name>PORF</name>
                            <description>desc PORF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PINRF</name>
                            <description>desc PINRF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BORF</name>
                            <description>desc BORF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1RF</name>
                            <description>desc PVD1RF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2RF</name>
                            <description>desc PVD2RF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDRF</name>
                            <description>desc WDRF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWDRF</name>
                            <description>desc SWDRF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDRF</name>
                            <description>desc PDRF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRF</name>
                            <description>desc SWRF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPUERF</name>
                            <description>desc MPUERF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAPERF</name>
                            <description>desc RAPERF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAECRF</name>
                            <description>desc RAECRF</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKFERF</name>
                            <description>desc CKFERF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALERF</name>
                            <description>desc XTALERF</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LKUPRF</name>
                            <description>desc LKUPRF</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MULTIRF</name>
                            <description>desc MULTIRF</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLRF</name>
                            <description>desc CLRF</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
